#include<iostream>
using namespace std;
/*
Да се намери броят на нулите в масива х.
(Да се състави фрагмент от програма,
който не променя стойността на х,
след чието изпълнение стойността
на някоя цяла променлива k да е
равна на броя на нулите сред елементите
в масива х.)
*/
int main()
{
    int n, k = 0;
    cin>>n;
    int x[n];

    /// По-скоро не
    for(int i = 0; i < n; i++)
    {
        cin>>x[i];
        if(x[i] == 0) k++;
    }

    /// По-добре така
    for(int i = 0; i < n; i++)
    {
        cin>>x[i];
    }
    for(int i = 0; i < n; i++)
    {
        if(x[i] == 0) k++;
    }
    cout<<k<<endl;



}
