#include<iostream>
using namespace std;
int main()
{
    /// Как декларираме масив?
    ///<тип> <име>[размер];
    /// int arr[5]; -> масив от тип int с име arr и размерност 5

    /// Задаване на стойности на клетките по начин 1 (без цикъл)
    int arr[5] = {1,2,3,4,5};
    double masiv[] = {1.0, 2.0, 3.0, 4.0, 5.0};

    
    /// Достъпване на стойност на клетка
    arr[0] = 10; /// На позиция 0 в масива arr слагаме числото 10
    arr[4] = 12; /// На позиция 4 в масива arr слагаме числото 12

    /// Принтираме стойностите на клетките на масива arr
    cout<<arr[0]<<endl;
    cout<<arr[1]<<endl;
    cout<<arr[2]<<endl;
    cout<<arr[3]<<endl;
    cout<<arr[4]<<endl;

    /// Задаване на стойности на клетките по начин 2 (с цикъл)
    int a[15];
    for(int i = 0; i < 15; i++)
    {
        cin>>a[i];
    }
    for(int i = 0; i < 15; i++)
    {
        cout<<a[i]<<" ";
    }

    /// Задачка, в която задаваме стойности само на кратните на 3 позиции
    int redica[30];
    for(int i = 0; i < 30; i++)
    {
        if(i % 3 == 0)
        {
            cin>>redica[i];
        }
    }
    for(int i = 0; i < 30; i++)
    {
        cout<<redica[i]<<" ";
    }


/*





    int a[10];
    double b[20000];
*/
    return 0;
}
