#include<iostream>
using namespace std;
/*
2.	Да се състави програма, чрез която се
въвеждат от клавиатурата 3 числа от интервала
[-99.99 .. 99.99]. Програмата да извежда
въведените числа във възходящ ред на
стойностите им.
Използвайте проверка на логическо условие
- оператор if.
Пример: 3.14, -2.73, 1.25
Изход: -2.73, 1.25, 3.14.

*/
int main()
{
double A,B,C;
cin>>A>>B>>C;
if(A<B&&B<C)
{
    cout<<A<<" "<<B<<" "<<C;
}
else if(A>B&&B>C)
{
    cout<<C<<" "<<B<<" "<<A;
}
else if(A>C&&C>B)
{
    cout<<B<<" "<<C<<" "<<A;
}

    return 0;
}
