#include<iostream>
using namespace std;


/*
Задача 1: Да се напише програма,
която отпечатва на екрана всички
двуцифрени числа, като
ги разделя едно от друго с по 1 интервала.
*/
int main()
{
    for(int i = 10; i < 100; i++)
    {
        cout<<i<<" ";
    }


    return 0;
}
