#include<iostream>
using namespace std;
int main()
{
    /*
    Да се състави програма, която въвежда от клавиатурата цели числа положителни и
    отрицателни от интервала [-1000 .. 1000]. Броят на числата е предварително фиксиран
    (въведен).
    Програмата да извежда средната абсолютна стойност от сумата от всяко второ въведено
    число.
    Пример: 2,-25,-30,-5,20,15 Изход: 15 // абсолютната стойност на -25 –5 + 15
    Използвайте цикъл while
    */
    int cnt, number, sum = 0;
    cin>>cnt;
    int i = 0;
    while(i < cnt)
    {
        cin>>number;
        if(i % 2 == 1)
        {
            sum += number;
        }
        i++;
    }
    if(sum < 0)
    {
        cout<<sum*(-1)<<endl;
    }
    else
    {
        cout<<sum<<endl;
    }

    return 0;
}
