#include<iostream>
using namespace std;
int main()
{
    /// >, < - по-голямо, по-малко
    /// >=, <= - по-голямо или равно, по-малко или равно
    /// == - дали това, която е от ляво на == е
    ///      равно на това,което е от дясно
    ///      на ==
    /// != - дали това, която е от ляво на == е
    ///      различно от това,което е от дясно
    ///      на ==


    int x;
    cin>>x;
    if(x > 0)
    {
        x = x * x;
    }
    else if(x == 0)
    {
        x = -1;
    }
    else
    {
        x = x * x * x;
    }

    cout<<x;

    return 0;
}
