#include<iostream>
using namespace std;
/*
Задача 6: Да се напише програма, която отпечатва
на екрана всички трицифрени, които имат
сбор от цифрите равен на 19. Числата да се
извеждат на един ред, разделени с по 2 интервала.
След това на нов ред да се изведе общия брой на
търсените числа.
*/

int main()
{
    int sum = 0, counter = 0;
    for(int i = 100; i < 1000; i++)
    {
        if(i % 10 + (i % 100 - i % 10) / 10 + (i - i % 100) / 100 == 19)
        {
            cout<<i<<"  ";
            counter++;      /// брояч за всички числа, които удовлетворяват условието на 17-ти ред
        }
    }
    cout<<endl<<counter;
    return 0;
}
